_Rarzrabotki/Kazna/Documents/ВводОстатковФинАгентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ВводОстатковФинАгентов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваФинАгенты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФинАгент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._Финагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Направления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/ДенежныеСредстваФинАгенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваФинАгенты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФинАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Финагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковФинАгентов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Documents/ВводОстатковФинАгентов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    // Инициализация движений
    Движения.ДенежныеСредстваФинАгенты.Записывать = Истина;
    Движения.ДенежныеСредстваФинАгенты.Очистить();
    
    // Формирование движений по табличной части
    Для Каждого СтрокаОстатка Из Остатки Цикл
        
		//// Проверка заполнения обязательных полей
		//Если Не ЗначениеЗаполнено(СтрокаОстатка.ФинАгент) Тогда
		//    Сообщить("В строке " + СтрокаОстатка.НомерСтроки + " не заполнен ФинАгент!");
		//    Отказ = Истина;
		//    Продолжить;
		//КонецЕсли;
		//
		//Если Не ЗначениеЗаполнено(СтрокаОстатка.Направление) Тогда
		//    Сообщить("В строке " + СтрокаОстатка.НомерСтроки + " не заполнено Направление!");
		//    Отказ = Истина;
		//    Продолжить;
		//КонецЕсли;
		//
		//Если СтрокаОстатка.Сумма = 0 Тогда
		//    Сообщить("В строке " + СтрокаОстатка.НомерСтроки + " указана нулевая сумма!");
		//    Отказ = Истина;
		//    Продолжить;
		//КонецЕсли;
        
        // Создаем движение
        Движение = Движения.ДенежныеСредстваФинАгенты.Добавить();
        Движение.Период = Дата;
        Движение.ФинАгент = СтрокаОстатка.ФинАгент;
        Движение.Направление = СтрокаОстатка.Направление;
        
        // Определяем вид движения, сумму и ДокументПередачи
        Если СтрокаОстатка.Сумма > 0 Тогда
            Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
            Движение.Сумма = СтрокаОстатка.Сумма;
            Движение.ДокументПередачи = ЭтотОбъект.Ссылка; // Ссылка на текущий документ
        Иначе
            Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
            Движение.Сумма = -СтрокаОстатка.Сумма; // Сумма в регистре всегда положительная
           // Движение.ДокументПередачи = Документы.ВводОстатковФинАгентов.ПустаяСсылка(); // Пустой для расхода
        КонецЕсли;
        
    КонецЦикла;
    
    // Проверка заполнения табличной части
    Если Остатки.Количество() = 0 Тогда
        Сообщить("Не заполнена табличная часть Остатки!");
        Отказ = Истина;
    КонецЕсли;
    
    // Проверка дублирования строк
    ТаблицаПроверки = Остатки.Выгрузить(, "ФинАгент, Направление");
    ТаблицаПроверки.Свернуть("ФинАгент, Направление", "");
    Если ТаблицаПроверки.Количество() < Остатки.Количество() Тогда
        Сообщить("В табличной части присутствуют дублирующиеся строки по ФинАгенту и Направлению!");
        Отказ = Истина;
    КонецЕсли;
    
КонецПроцедуры
